test/request-response-samples/Dummy__should_handle_empty_string_with_pattern_restriction/request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://www.Dummy.com">
  <soap:Body>
    <DummyRequest xmlns="http://www.Dummy.com"></DummyRequest>
  </soap:Body>
</soap:Envelope>