test/request-response-samples/Dummy__should_use_defined_xml_key_in_first_level_for_rpc/request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://www.Dummy.com" xmlns:n="http://www.Dummy.com/Name/Types"><soap:Body><tns:Dummy><tns:DummyXML><myObject attr='myAttr'></myObject></tns:DummyXML></tns:Dummy></soap:Body></soap:Envelope>