test/request-response-samples/Dummy__ref_element_should_have_correct_namespace_with_overrideElementKey/request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:dummy="http://www.Dummy.com"
    xmlns:tns="http://www.Dummy.com"
    xmlns:common="http://www.Dummy.com/Common">
    <soap:Body>
        <dummy:DummyRequest
            xmlns:dummy="http://www.Dummy.com"
            xmlns="http://www.Dummy.com">
            <common:Commande
                xmlns:common="http://www.Dummy.com/Common">
                <common:Id>1</common:Id>
                <common:Nom>foo</common:Nom>
            </common:Commande>
        </dummy:DummyRequest>
    </soap:Body>
</soap:Envelope>
